OpenFOAM/foam9tutorials/CFD/1DPyrolysis/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    front
    {
        type            zeroGradient;
    }

    back
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    region0_to_sampleRegion_sample
    {
        type            totalFlowRateAdvectiveDiffusive;
        massFluxFraction 0;
        value           uniform 0;
/*
        type                zeroFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
*/
    }
}

// ************************************************************************* //
