OpenFOAM/foam9tutorials/CFD/1DPyrolysis/0/sampleRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }

    sample_top
    {
        type            zeroGradient;
    }

    oneDEmptyPatch
    {
        type            empty;
    }

    region0_to_sampleRegion_sample
    {
        type                fixedIncidentRadiation;
        kappa               solidThermo;
        kappaName           none;
        QrIncident          uniform 50000.0;   //W/m2
        value               uniform 293.;
    }

}

// ************************************************************************* //
