OpenFOAM/foam9tutorials/CFD/1DPyrolysis/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(phi,k)      Gauss limitedLinear 1.0;
    div(phi,Yi_h)   Gauss multivariateSelection
    {
        CH4         limitedLinear01 1.0;
        H2O         limitedLinear01 1.0;
        CO2         limitedLinear01 1.0;
        O2          limitedLinear01 1.0;
        N2          limitedLinear01 1.0;
        h           limitedLinear 1.0;
    };
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(phiU,p)         Gauss linear;
    div(Ji,Ii_h)        Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
}


// ************************************************************************* //
