OpenFOAM/foam9tutorials/CFD/1DPyrolysis/system/sampleRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 20;

method          structured;

structuredCoeffs
{
    method      hierarchical;
    patches     (region0_to_sampleRegion_sample);

    hierarchicalCoeffs
    {
         n               ( 1 20 1 );
         delta           0.001;
         order           xyz;
    }
}

// ************************************************************************* //
